
group1 = ["Иванов", "Петров", "Сидоров", "Козлов", "Михайлов", "Новиков", "Кузнецов", "Соловьев", "Васильев", "Попов"]
group2 = ["Смирнов", "Морозов", "Ковалев", "Зайцев", "Борисов", "Лебедев", "Соколов", "Дмитриев", "Федоров", "Комаров"]


sports_team = tuple(group1[:5] + group2[:5])


print("Фамилии студентов группы 1:", group1)
print("Фамилии студентов группы 2:", group2)
print("Спортивная команда:", sports_team)


print("Длина кортежа:", len(sports_team))


sorted_team = sorted(sports_team)
print("Отсортированная команда:", sorted_team)


ivanov_count = sports_team.count("Иванов")
if ivanov_count > 0:
    print("Студент Иванов входит в команду.")
    print("Фамилия Иванов встречается", ivanov_count, "раз(а) в команде.")
else:
    print("Студент Иванов не входит в команду.")